In [1]:
'Data Cleaning'

'Data Cleaning'

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.isnull(np.nan)

True

In [22]:
df = pd.DataFrame({
    'Column A': [1, np.nan, 30],
    'Column B': [2, np.nan, 31],
    'Column C': [np.nan, np.nan, 100]
})

df

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [23]:
columnD = pd.Series([5, 8, 34], name='Column D')

In [24]:
columnD

0     5
1     8
2    34
Name: Column D, dtype: int64

In [25]:
df['Column D'] = columnD

In [26]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       NaN       NaN         8
2      30.0      31.0     100.0        34

In [27]:
df.dropna(how='any', axis=1)

   Column D
0         5
1         8
2        34

In [16]:
df.dropna(thresh=2, axis=1)

   Column A  Column B  Column D
0       1.0       2.0         5
1       NaN       NaN         8
2      30.0      31.0        34

In [17]:
df.fillna(0)

   Column A  Column B  Column C  Column D
0       1.0       2.0       0.0         5
1       0.0       0.0       0.0         8
2      30.0      31.0     100.0        34

In [28]:
df.fillna(df.mean())

   Column A  Column B  Column C  Column D
0       1.0       2.0     100.0         5
1      15.5      16.5     100.0         8
2      30.0      31.0     100.0        34

In [29]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       NaN       NaN         8
2      30.0      31.0     100.0        34

In [33]:
df.fillna(method='bfill', axis=1)

   Column A  Column B  Column C  Column D
0       1.0       2.0       5.0       5.0
1       8.0       8.0       8.0       8.0
2      30.0      31.0     100.0      34.0